{
  "blogs": [
    {
      "title": "My new portfolio website",
      "body": "Hey everyone! \n\nI'm excited to announce that **TechTomDK**, my brand new website, is officially live and available for you to explore! 🎉 After weeks of designing, coding, and putting everything together, I'm proud to share a space that showcases my work, creativity, and passion for multimedia design.\n\n---\n\n### What You’ll Find on TechTomDK\n\nOn TechTomDK, you can check out a collection of my projects from my time studying **Multimedia Design**. During my studies, I got the chance to work on a variety of creative and technical projects, from designing sleek user interfaces to building interactive websites, and now you can see it all in one place.\n\n- **Portfolio of Projects**: I’ve included a portfolio of my best projects. Each one demonstrates different aspects of my design and development skills, from graphic design and animations to web development and UX/UI.\n- **Custom Assets & Animations**: I’ve always loved using **Illustrator** to create custom assets, and TechTomDK is no exception! You’ll see some unique illustrations and visual elements I made, and I’ve also added **animations** to bring those assets to life on the site. It was a bit tricky, but after following some great tutorials, I’m really happy with how it turned out.\n- **User-Friendly Design**: I focused on making the site clean, modern, and easy to navigate, whether you’re on your phone, tablet, or desktop. Responsive design was key to ensuring a smooth user experience for everyone who visits.\n\n---\n\n### The Journey Back Into Coding\n\nIt had been a while since I tackled a big project like this, but it felt amazing to dive back into **coding**. I built the site using **React**, which allowed me to create an interactive and dynamic experience. If you’re a fellow coder or design enthusiast, I think you’ll appreciate the mix of design principles and front-end development that went into making this portfolio come to life.\n\nWorking on this project has been a great reminder of why I love multimedia design and coding. It gave me the chance to combine my technical skills with my creative side, and I couldn’t be more proud of the result.\n\n---\n\n### What’s Next?\n\nWith the launch of TechTomDK, I’m excited to keep adding more content and expanding the portfolio over time. Whether it’s new projects, blog posts, or learning new technologies, there’s always more to come.\n\nFeel free to explore the site, check out my portfolio, and reach out if you have any feedback or just want to chat. If you’re a student, designer, or developer working on your own portfolio, I’d love to connect and exchange ideas!\n\nThanks for visiting, and I hope you enjoy TechTomDK as much as I enjoyed creating it.\n\nStay tuned for more updates, and see you soon!\n\n**Tom**",
      "author": "Tom",
      "id": "1"
    },
    {
      "title": "Ellies Birthday party",
      "body": "Hey everyone! \n\nI'm excited to share that our little Ellie is turning 2 soon, and we’re hosting a birthday party to celebrate! 🎉 We're planning the party for a couple of weeks from now in the function room underneath our apartment building.\n\n---\n\n### Party Details\n\nWe're looking forward to gathering friends and family for a fun-filled day with coffee, cake, and some sweet treats. In addition to the cake, we'll have **buns**, **soft drinks**, and other refreshments, so there'll be plenty for everyone to enjoy!\n\nIt's a special milestone for Ellie, and we can't wait to celebrate with all the people who mean so much to us.\n\n---\n\n### Save the Date\n\nThe party will take place in the function room just downstairs from our apartment. It's a cozy spot, perfect for hosting family get-togethers like this. We’ll be sending out official invites soon, so keep an eye out for that.\n\nThanks for reading, and we can’t wait to celebrate Ellie’s big day with everyone!\n\n**Tom**",
      "author": "Tom",
      "id": "2"
    },
    {
      "title": "My Journey into Coding",
      "body": "Hey everyone! \n\nI wanted to take some time to reflect on my journey into coding and how it all started. Coding has been a huge part of my life, and it's amazing to see how far I’ve come since those early days.\n\n---\n\n### The Beginning\n\nMy journey began when I first developed an interest in technology and how things work behind the scenes. It was during my studies in **Multimedia Design** that I really started diving into coding. Learning how to design websites, create interactive experiences, and build functional applications was a game-changer for me. \n\nBack then, I was amazed by the possibilities of coding – taking an idea from concept to reality was incredibly empowering.\n\n---\n\n### Learning and Growth\n\nOver the years, I’ve learned multiple languages like **HTML**, **CSS**, **JavaScript**, and more recently, **React**. Each one presented its own challenges, but with persistence and a love for solving problems, I was able to improve my skills and tackle bigger, more complex projects.\n\nOne of my proudest achievements was building my portfolio website, **TechTomDK**, where I showcased many of the projects I worked on during my studies. It was a great way to combine design with coding and really cemented my passion for web development.\n\n---\n\n### What's Next?\n\nThe beauty of coding is that there's always something new to learn. I'm constantly improving my skills and exploring new technologies. Whether it's creating engaging user interfaces, exploring the world of animations, or building more advanced applications, I’m excited for what’s ahead in my coding journey.\n\nThanks for reading, and if you're interested in coding or multimedia design, I'd love to connect and share ideas!\n\n**Tom**",
      "author": "Tom",
      "id": "3"
    }
  ]
}